Revit 2024 API
StairsRun.GetLeftSupports Method
 Retrieves all supports on the left side of run boundaries.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<ElementId> GetLeftSupports()
Visual Basic
Public Function GetLeftSupports As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetLeftSupports()
Return Value
 The supports on the left side of run boundaries.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace